[
  "obsidian-outliner",
  "obsidian-icon-folder",
  "dataview",
  "table-editor-obsidian",
  "obsidian-kanban",
  "obsidian-git",
  "obsidian-tasks-plugin",
  "cm-editor-syntax-highlight-obsidian",
  "recent-files-obsidian",
  "obsidian-textgenerator-plugin",
  "make-md",
  "obsidian-image-toolkit",
  "obsidian-sortable",
  "obsidian-show-file-path",
  "kr-book-info-plugin",
  "templater-obsidian",
  "obsidian-style-settings"
]