[
  "obsidian-outliner",
  "dataview",
  "table-editor-obsidian",
  "obsidian-kanban",
  "obsidian-git",
  "obsidian-tasks-plugin",
  "cm-editor-syntax-highlight-obsidian",
  "recent-files-obsidian",
  "obsidian-textgenerator-plugin",
  "make-md",
  "obsidian-image-toolkit",
  "obsidian-sortable",
  "obsidian-show-file-path",
  "kr-book-info-plugin",
  "templater-obsidian",
  "obsidian-style-settings",
  "quick-explorer",
  "obsidian-advanced-slides",
  "obsidian-path-title",
  "reveal-file-in-explorer",
  "obsidian-reveal-active-file",
  "obsidian-html-plugin",
  "obsidian-icon-folder",
  "notion-like-tables"
]